import { BingoElement } from 'src/app/core/types';

// Data for elements list
// export const MOCK_DATA: string[] = ['1', '2', '3'];

// Data for table
export const MOCK_TABLE: BingoElement[][] = [
  [
    { id: '1', value: '1' },
    { id: '2', value: '2' },
  ],
  [
    { id: '3', value: '3' },
    { id: '4', value: '4' },
  ],
];

// Mock data for testing
export const MOCK_DATA: string[] = [
  'ловил segfault',
  'программировал за деньги',
  'имитировал удовольствие от проекта',
  'занимался парным программированием',
  'покрыл вообще все тестами',
  'писал код на чужой работе',
  'деплоил код без проверки',
  'застукали как ты пытаешься втащить новый фреймворк',
  'отладка и поиск бага по переписке/звонку без доступа к машине',
  'программировал с чуваками, которые кодили до твоего рождения',
  'участвовал в хакатонах',
  'сменил более 30 проектов',
  'программировал пьяным',
  'есть пет-проект',
  'кодил в общественном месте',
  'участвовал в "проекте на раз"',
  'записывал тестерам вмдео со сценариями работы',
  'были аварии на проде из-за тебя',
  'кодил во время нудного митинга',
  'обучал джуна',
  'брался за работу фуллстэка не умея в бекенд или фронтенд',
  'слушал и кивал на: "Ну на след. ревью обязательно тебя повысим"',
  'писал код без единой ошибки с первого раза',
  'делал проект, от которого очень хотел отказаться',
  'стримил решение литкода',
];
